testdata/IN_2023_02/Roundtrip/produkt/rente/bir/20160216_nettobeitrag_abgekuerzte_beitragszahlungsdauer_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          
      <tarif:Request>
                
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                
        <tarif:Tarifierung>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <partner:Anrede>1</partner:Anrede>
                            
            <partner:PartnerID>1</partner:PartnerID>
                            
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                            
            <partner:Geschlecht>1</partner:Geschlecht>
                            
            <partner:Berufstaetigkeit>
                                
              <partner:Beruf>Maler- u. Lackierermeister</partner:Beruf>
                                
              <partner:StellungImBeruf xsi:type="dt:STE_StellungImBerufBasis">01</partner:StellungImBeruf>
                              
            </partner:Berufstaetigkeit>
                        
          </tarif:Partner>
                    
          <tarif:Versicherungsnehmer>
                        
            <partner:PartnerID>1</partner:PartnerID>
                      
          </tarif:Versicherungsnehmer>
                    
          <tarif:Verkaufsprodukt>
                        
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                            
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                              
              </basis:Erweiterung>
                            
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                            
              <pm:Beitrag>
                                
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">02</pm:ArtID>
                                
                <pm:Betrag>
                                    
                  <allg:Betrag>200</allg:Betrag>
                                    
                  <allg:Waehrung>EUR</allg:Waehrung>
                                  
                </pm:Betrag>
                                
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                
                <pm:Erhebung>
                                    
                  <allg:AnzahlJahre>34</allg:AnzahlJahre>
                                  
                </pm:Erhebung>
                              
              </pm:Beitrag>
                            
              <pm:Versicherungsdauer>
                                
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
              
              </pm:Versicherungsdauer>
                            
              <pm:Kennung>BIR</pm:Kennung>
                            
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                                
                <basis:Erweiterung xsi:type="vbl:CT_RenteErweiterung">
                                    
                  <vbl:TodesfallleistungImBezug>IndividuelleGarantiezeit</vbl:TodesfallleistungImBezug>
                                    
                  <vbl:BasisrenteDaten>
                                        
                    <vbl:VorgabeartTodesfallsumme>Keine</vbl:VorgabeartTodesfallsumme>
                                      
                  </vbl:BasisrenteDaten>
                                    
                  <vbl:IndexDaten>
                                        
                    <vbl:VorgabeartIndexbeteiligung>Chance</vbl:VorgabeartIndexbeteiligung>
                                        
                    <vbl:Index>DAX</vbl:Index>
                                      
                  </vbl:IndexDaten>
                                  
                </basis:Erweiterung>
                                
                <pm:Versicherungsdauer>
                                    
                  <allg:AnzahlJahre>37</allg:AnzahlJahre>
                                  
                </pm:Versicherungsdauer>
                                
                <pm:Dynamik>
                                    
                  <basis:Erweiterung xsi:type="vbl:CT_DynamikErweiterung">
                                        
                    <vbl:Art>TodesUndErlebensfall</vbl:Art>
                                      
                  </basis:Erweiterung>
                                    
                  <pm:ArtID xsi:type="dt:STE_DynamikBasis">05</pm:ArtID>
                                    
                  <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                    
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                                  
                </pm:Dynamik>
                                
                <vs-pm:VersicherungssummeOderLeistung>
                                    
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                    
                  <vs-pm:Wertschluessel xsi:type="vbl:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                                    
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                    
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                    
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                  
                </vs-pm:VersicherungssummeOderLeistung>
                                
                <pm-leben:Hochrechnungszins>5</pm-leben:Hochrechnungszins>
                                
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                
                <pm-leben:UeberschussverwendungNachLeistung xsi:type="dt:STE_UeberschussverwendungBasis">15</pm-leben:UeberschussverwendungNachLeistung>
                                
                <pm-leben:VersichertePerson>
                                    
                  <partner:PartnerID>1</partner:PartnerID>
                                  
                </pm-leben:VersichertePerson>
                                
                <pm-leben:Garantiezeit>
                                    
                  <allg:AnzahlJahre>15</allg:AnzahlJahre>
                                  
                </pm-leben:Garantiezeit>
                              
              </pm:Elementarprodukt>
                            
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                
                <pm:Versicherungsdauer>
                                    
                  <allg:AnzahlJahre>32</allg:AnzahlJahre>
                                  
                </pm:Versicherungsdauer>
                                
                <pm:Dynamik>
                                    
                  <pm:ArtID xsi:type="dt:STE_DynamikBasis">06</pm:ArtID>
                                    
                  <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                    
                  <pm:KategorieID>Leistung</pm:KategorieID>
                                  
                </pm:Dynamik>
                                
                <vs-pm:VersicherungssummeOderLeistung>
                                    
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                    
                  <vs-pm:Wert>250</vs-pm:Wert>
                                    
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                    
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                    
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                    
                  <vs-pm:Zeitraum>
                                        
                    <allg:AnzahlJahre>36</allg:AnzahlJahre>
                                      
                  </vs-pm:Zeitraum>
                                  
                </vs-pm:VersicherungssummeOderLeistung>
                                
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                                
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">08</pm-leben:UeberschussverwendungVorLeistung>
                                
                <pm-leben:VersichertePerson>
                                    
                  <partner:PartnerID>1</partner:PartnerID>
                                  
                </pm-leben:VersichertePerson>
                                
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                                
                <pm-leben:Auspraegung xsi:type="dt:STE_UnfaehigkeitsZusatzAuspraegungBasis">BU</pm-leben:Auspraegung>
                                
                <pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>false</pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>
                              
              </pm:Elementarprodukt>
                            
              <pm-leben:VorgabeBerechnung>
                                
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Nettobeitrag</pm-leben:ArtID>
                                
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                              
              </pm-leben:VorgabeBerechnung>
                          
            </pm:Produkt>
                      
          </tarif:Verkaufsprodukt>
                 
        </tarif:Tarifierung>
            
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
